import {Component, OnInit} from '@angular/core';

@Component({
    selector: 'app-check-complaint',
    templateUrl: './check-complaint.component.html',
    styleUrls: ['./check-complaint.component.scss']
})
export class CheckComplaintComponent implements OnInit {

    page = 1;
    items: { name: string, route: string, complainant: string ,detail:string}[] = [
        {name: 'Walk In', route: 'walk-in', complainant: 'นายสมชาย ใจดี',detail:'มีคนนำวัคซีนอหิวาห์ไก่มาขาย ทั้งที่ซื้อที่ปศุสัตว์ราคา 30 บาทแต่นำมาขาย 200 บาท ในเฟสบุ๊ค' +
                'ชื่อเฟส facebook "ฟามาโกร วัคซีนป้องกันโรคสัตว์ปีก"เรื่องนี้เกิดมา 2 ปีแล้ว ผมตามมานานมากอย่าให้ซ้ำรอย วัคซีน พิษสุนัชบ้านะครับผมไม่เห็นด้วย เพราะผมปรึกษานายสัตวแพทย์จังหวัดแล้ว พบว่า' +
                ' เวลาไปซื้อไม่มีวัคซีนให้เกษตรกร แต่ทำไม มีขายในเฟสบุ๊ค ช่วยตรวจสอบหน่วยงานนี้ด้วยครับประชาชนข้องใจครับ' +
                'ผมไม่ได้มีส่วนได้ส่วนเสียแต่ไม่เข้าใจว่า วัคซีน 30 บาท ทำไมมาขาย 200 บาท ทั้งที่เขียนไว้ว่าห้ามจำหน่าย'},
        {name: 'ไปรษณีย์', route: 'post', complainant: 'นายจอห์น วิก',detail:'มีคนนำวัคซีนอหิวาห์ไก่มาขาย ทั้งที่ซื้อที่ปศุสัตว์ราคา 30 บาทแต่นำมาขาย 200 บาท ในเฟสบุ๊ค' +
                'ชื่อเฟส facebook "ฟามาโกร วัคซีนป้องกันโรคสัตว์ปีก"เรื่องนี้เกิดมา 2 ปีแล้ว ผมตามมานานมากอย่าให้ซ้ำรอย วัคซีน พิษสุนัชบ้านะครับผมไม่เห็นด้วย เพราะผมปรึกษานายสัตวแพทย์จังหวัดแล้ว พบว่า' +
                ' เวลาไปซื้อไม่มีวัคซีนให้เกษตรกร แต่ทำไม มีขายในเฟสบุ๊ค ช่วยตรวจสอบหน่วยงานนี้ด้วยครับประชาชนข้องใจครับ' +
                'ผมไม่ได้มีส่วนได้ส่วนเสียแต่ไม่เข้าใจว่า วัคซีน 30 บาท ทำไมมาขาย 200 บาท ทั้งที่เขียนไว้ว่าห้ามจำหน่าย'},
        {name: 'Call Center', route: 'call-center', complainant: 'นางสมหญิง ใจเด็ด',detail:'มีคนนำวัคซีนอหิวาห์ไก่มาขาย ทั้งที่ซื้อที่ปศุสัตว์ราคา 30 บาทแต่นำมาขาย 200 บาท ในเฟสบุ๊ค' +
                'ชื่อเฟส facebook "ฟามาโกร วัคซีนป้องกันโรคสัตว์ปีก"เรื่องนี้เกิดมา 2 ปีแล้ว ผมตามมานานมากอย่าให้ซ้ำรอย วัคซีน พิษสุนัชบ้านะครับผมไม่เห็นด้วย เพราะผมปรึกษานายสัตวแพทย์จังหวัดแล้ว พบว่า' +
                ' เวลาไปซื้อไม่มีวัคซีนให้เกษตรกร แต่ทำไม มีขายในเฟสบุ๊ค ช่วยตรวจสอบหน่วยงานนี้ด้วยครับประชาชนข้องใจครับ' +
                'ผมไม่ได้มีส่วนได้ส่วนเสียแต่ไม่เข้าใจว่า วัคซีน 30 บาท ทำไมมาขาย 200 บาท ทั้งที่เขียนไว้ว่าห้ามจำหน่าย'},
        {name: 'Internet', route: 'internet', complainant: 'นางสาวมะนาว โซดา',detail:'มีคนนำวัคซีนอหิวาห์ไก่มาขาย ทั้งที่ซื้อที่ปศุสัตว์ราคา 30 บาทแต่นำมาขาย 200 บาท ในเฟสบุ๊ค' +
                'ชื่อเฟส facebook "ฟามาโกร วัคซีนป้องกันโรคสัตว์ปีก"เรื่องนี้เกิดมา 2 ปีแล้ว ผมตามมานานมากอย่าให้ซ้ำรอย วัคซีน พิษสุนัชบ้านะครับผมไม่เห็นด้วย เพราะผมปรึกษานายสัตวแพทย์จังหวัดแล้ว พบว่า' +
                ' เวลาไปซื้อไม่มีวัคซีนให้เกษตรกร แต่ทำไม มีขายในเฟสบุ๊ค ช่วยตรวจสอบหน่วยงานนี้ด้วยครับประชาชนข้องใจครับ' +
                'ผมไม่ได้มีส่วนได้ส่วนเสียแต่ไม่เข้าใจว่า วัคซีน 30 บาท ทำไมมาขาย 200 บาท ทั้งที่เขียนไว้ว่าห้ามจำหน่าย'},
        {name: 'Mobile', route: 'mobile', complainant: 'นายรุ่งเรือง จิตใจดี',detail:'มีคนนำวัคซีนอหิวาห์ไก่มาขาย ทั้งที่ซื้อที่ปศุสัตว์ราคา 30 บาทแต่นำมาขาย 200 บาท ในเฟสบุ๊ค' +
                'ชื่อเฟส facebook "ฟามาโกร วัคซีนป้องกันโรคสัตว์ปีก"เรื่องนี้เกิดมา 2 ปีแล้ว ผมตามมานานมากอย่าให้ซ้ำรอย วัคซีน พิษสุนัชบ้านะครับผมไม่เห็นด้วย เพราะผมปรึกษานายสัตวแพทย์จังหวัดแล้ว พบว่า' +
                ' เวลาไปซื้อไม่มีวัคซีนให้เกษตรกร แต่ทำไม มีขายในเฟสบุ๊ค ช่วยตรวจสอบหน่วยงานนี้ด้วยครับประชาชนข้องใจครับ' +
                'ผมไม่ได้มีส่วนได้ส่วนเสียแต่ไม่เข้าใจว่า วัคซีน 30 บาท ทำไมมาขาย 200 บาท ทั้งที่เขียนไว้ว่าห้ามจำหน่าย'},
        {name: 'ผผ.หยิบยก', route: 'own-motion', complainant: 'นายเจ้าขุน ทอง',detail:'มีคนนำวัคซีนอหิวาห์ไก่มาขาย ทั้งที่ซื้อที่ปศุสัตว์ราคา 30 บาทแต่นำมาขาย 200 บาท ในเฟสบุ๊ค' +
                'ชื่อเฟส facebook "ฟามาโกร วัคซีนป้องกันโรคสัตว์ปีก"เรื่องนี้เกิดมา 2 ปีแล้ว ผมตามมานานมากอย่าให้ซ้ำรอย วัคซีน พิษสุนัชบ้านะครับผมไม่เห็นด้วย เพราะผมปรึกษานายสัตวแพทย์จังหวัดแล้ว พบว่า' +
                ' เวลาไปซื้อไม่มีวัคซีนให้เกษตรกร แต่ทำไม มีขายในเฟสบุ๊ค ช่วยตรวจสอบหน่วยงานนี้ด้วยครับประชาชนข้องใจครับ' +
                'ผมไม่ได้มีส่วนได้ส่วนเสียแต่ไม่เข้าใจว่า วัคซีน 30 บาท ทำไมมาขาย 200 บาท ทั้งที่เขียนไว้ว่าห้ามจำหน่าย'}];

    result: any;

    constructor() {
    }

    ngOnInit() {
    }

}
