import {Component, OnInit} from '@angular/core';

@Component({
    selector: 'app-fact',
    templateUrl: './fact.component.html',
    styleUrls: ['./fact.component.scss']
})
export class FactComponent implements OnInit {

    texts: string[] = [
        '1. (ประธานผู้ตรวจการแผ่นดิน/ผู้ตรวจการแผ่นดิน)ได้เห็นชอบให้รับเรื่องร้องเรียนของ.................................................................. ไว้พิจารณาเมื่อวันที่.....................................................\n' +
        '2. สำนักงานผู้ตรวจการแผ่นดิน ได้มีหนังสือ (ลับ/ด่วนที่สุด) ที่ ผผ................./................ลงวันที่.....................ขอให้............(ระบุชื่อหน่วยงาน)..................... ชี้แจงข้อเท็จจริง\n' +
        'และส่งเอกสารหลักฐานเกี่ยวกับเรื่องร้องเรียนภายใน 30 วัน นับแต่วันที่ได้รับหนังสือ\n' +
        '3. (หน่วยงานที่เกี่ยวข้อง) มีหนังสือ ที่.....................................ชี้แจงข้อเท็จจริง และส่งเอกสารหลักฐานที่เกี่ยวข้องเพื่อประกอบการพิจารณา',
        '',
        '(หน่วยงานที่เกี่ยวข้อง) ชี้แจงข้อเท็จจริงสรุปได้ว่า.........................................',
        '1. พระราชบัญญัติประกอบรัฐธรรมนูญว่าด้วยผู้ตรวจการแผ่นดิน พ.ศ. 2562 \n' +
        '2. ............................................................................................................................................................',
        'สำนัก.........................................พิจารณาข้อเท็จจริงและข้อกฏหมายที่เกี่ยวข้องแล้วเห็นว่า.....................................................................................\n' +
        'ผู้ตรวจการแผ่นดินได้พิจารณาข้อเท็จจริงและข้อกฏหมายข้างต้นแล้วเห็นว่า...............................................................................................................',
        'จึงเห็นควรยุติเรื่องร้องเรียนตาม .........(กฏหมาย).................................................................\n' +
        'อาศัยอำนาจตามความในมาตรา..........................................................................................แห่งพระราชบัญญัติประกอบรัฐธรรมนูญว่าด้วยผู้ตรวจการแผ่นดิน พ.ศ.2560 ผู้ตรวการแผ่นดินจึงมีคำวินิจฉัยให้.......................................................................................และเพื่อมิให้เกิดปัญหาการร้องเรียนในลักษณะดังกล่าวอีก ผู้ตรวจการแผ่นดินจึงมีข้อเสนอแนะให้..................................................................................',
    ];

    constructor() {
    }

    ngOnInit() {
    }

}
